    Import required libraries

In [1]:
import numpy as np
import pandas as pd
pd.set_option('display.max_columns',None)
pd.set_option('display.max_rows',None)

In [2]:
df=pd.read_csv('../../../powerbi/Capstone_Project/Weather_Analysis/Data/Transformed/final_fact.csv')

In [3]:
df.head()

,City_id,date_id,time_id,humidity,pressure,temperature,weather_description,wind_direction,wind_speed
0,1,1,1,NaN,NaN,NaN,NaN,NaN,NaN
1,1,1,2,76.0,NaN,284.630000,mist,0.0,0.0
2,1,1,3,76.0,NaN,284.629041,broken clouds,6.0,0.0
3,1,1,4,76.0,NaN,284.626998,broken clouds,20.0,0.0
4,1,1,5,77.0,NaN,284.624955,broken clouds,34.0,0.0

    import data

In [3]:
import os

In [7]:
os.listdir('../../../powerbi/Capstone_Project/Weather_Analysis/Data/Transformed/csv')

['city_attributes.csv',
 'city_lookup.csv',
 'country.csv',
 'date_lookup.csv',
 'final_fact.csv',
 'time_lookup.csv']

In [10]:
for i in [i for i in os.listdir('../../../powerbi/Capstone_Project/Weather_Analysis/Data/Transformed/csv')]:
    df=pd.read_csv(f'A:/work/acciojob/powerbi/Capstone_Project/Weather_Analysis/Data/Transformed/csv/{i}')
    display(df.head())

   Country_id  City_id   Latitude   Longitude
0           1        1  49.249660 -123.119339
1           2        2  45.523449 -122.676208
2           2        3  37.774929 -122.419418
3           2        4  47.606209 -122.332069
4           2        5  34.052231 -118.243683

   City_id           City
0        1      Vancouver
1        2       Portland
2        3  San Francisco
3        4        Seattle
4        5    Los Angeles

   Country_id        Country
0           1         Canada
1           2  United States
2           3         Israel

   date_id        date
0        1  2012-10-01
1        2  2012-10-02
2        3  2012-10-03
3        4  2012-10-04
4        5  2012-10-05

,City_id,date_id,time_id,humidity,pressure,temperature,weather_description,wind_direction,wind_speed
0,1,1,1,NaN,NaN,NaN,NaN,NaN,NaN
1,1,1,2,76.0,NaN,284.630000,mist,0.0,0.0
2,1,1,3,76.0,NaN,284.629041,broken clouds,6.0,0.0
3,1,1,4,76.0,NaN,284.626998,broken clouds,20.0,0.0
4,1,1,5,77.0,NaN,284.624955,broken clouds,34.0,0.0

   time_id      time
0        1  12:00:00
1        2  13:00:00
2        3  14:00:00
3        4  15:00:00
4        5  16:00:00

In [ ]:
df=pd.read_csv('../data/bank-additional.csv',delimiter=';')

In [ ]:
df.head()

In [ ]:
df.info()

In [ ]:
df.columns

In [ ]:
map_columns={    
    'age':'Age',
    'job':'Job_Type', 
    'marital':'Marital_Status', 
    'education':'Education_Level', 
    'default':'Default', 
    'housing':'House', 
    'loan':'Existing_Loan',
    'contact':'Contact_Type', 
    'month':'Month', 
    'day_of_week':'Day_Of_Week', 
    'duration':'Duration_of_Call', 
    'campaign':'Campaign', 
    'pdays':'Pdays',
    'previous':'Previous', 
    'poutcome':'Previous_Outcome', 
    'emp.var.rate':'Emp_Var_rate', 
    'cons.price.idx':'Cons_price_Index',
    'cons.conf.idx':'Cons_Conf_Index', 
    'euribor3m':'European_rate', 
    'nr.employed':'Nr_Employed', 
    'y':'Subscribed'
}

In [ ]:
df.sample()

In [ ]:
df.rename(columns=map_columns,inplace=True)

In [ ]:
df['Default'].unique()

    no => 0
    yes => 1
    unknown => -1

In [ ]:
lst=['1','2','3','4']
lst

In [ ]:
int_lst=[]
for i in lst:
    int_lst.append(int(i)) 
int_lst

In [ ]:
a='5'
def convert_int(x,y):
    return x+y

In [ ]:
convert_int(a)

In [ ]:
list(map(convert_int,lst,lst))

In [ ]:
def convert_upper(x):
    return x.upper()

In [ ]:
type(df['Default'])

In [ ]:
lambda x : x.upper()

In [ ]:
choice= input()
msg=-1
if choice=='yes':
    msg=1
elif choice=='no':
    msg=0
elif choice=='unknown':
    msg=-1

In [ ]:
choice=input()

In [ ]:
msg= 1 if choice=='yes' else 0 if choice=='no' else -1
msg

In [ ]:
map_default={
    'yes':1,
    'no':0,
    'unknown':-1
}

In [ ]:
df['Default'].head()

In [ ]:
df['Default'].value_counts(normalize=True)*100

In [ ]:
df['Default'].replace(map_default,inplace=True)

In [ ]:
df['Default'].apply(lambda x : x.upper())

In [55]:
import datetime as dt

In [58]:
now=dt.datetime.now()

In [59]:
now+dt.timedelta(days=-3)

datetime.datetime(2023, 12, 18, 23, 0, 42, 491198)

In [56]:
dir(dt)

['MAXYEAR',
 'MINYEAR',
 'UTC',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 'date',
 'datetime',
 'datetime_CAPI',
 'time',
 'timedelta',
 'timezone',
 'tzinfo']